using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

/// <summary>
/// https://github.com/zmjack/Chinese
/// </summary>
namespace NovelChecker.Package.Chinese
{
    public static class ChineseNumerical
    {
        public static readonly Dictionary<string, int> Numerical = new Dictionary<string, int>()
        {
            { "壹",1 },
            { "贰",2 },
            { "叁",3 },
            { "肆",4 },
            { "伍",5 },
            { "陆",6 },
            { "柒",7 },
            { "捌",8 },
            { "玖",9 },
            { "壹拾",10 },
            { "贰拾",20 },
            { "叁拾",30 },
            { "肆拾",40 },
            { "伍拾",50 },
            { "陆拾",60 },
            { "柒拾",70 },
            { "捌拾",80 },
            { "玖拾",90 },
            { "壹佰",100 },
            { "贰佰",200 },
            { "叁佰",300 },
            { "肆佰",400 },
            { "伍佰",500 },
            { "陆佰",600 },
            { "柒佰",700 },
            { "捌佰",800 },
            { "玖佰",900 },
            { "壹仟",1000 },
            { "贰仟",2000 },
            { "叁仟",3000 },
            { "肆仟",4000 },
            { "伍仟",5000 },
            { "陆仟",6000 },
            { "柒仟",7000 },
            { "捌仟",8000 },
            { "玖仟",9000 },
            { "一",1 },
            { "二",2 },
            { "两",2 },
            { "三",3 },
            { "四",4 },
            { "五",5 },
            { "六",6 },
            { "七",7 },
            { "八",8 },
            { "九",9 },
            { "一十",10 },
            { "二十",20 },
            { "三十",30 },
            { "四十",40 },
            { "五十",50 },
            { "六十",60 },
            { "七十",70 },
            { "八十",80 },
            { "九十",90 },
            { "一百",100 },
            { "二百",200 },
            { "两百",200 },
            { "三百",300 },
            { "四百",400 },
            { "五百",500 },
            { "六百",600 },
            { "七百",700 },
            { "八百",800 },
            { "九百",900 },
            { "一千",1000 },
            { "二千",2000 },
            { "两千",2000 },
            { "三千",3000 },
            { "四千",4000 },
            { "五千",5000 },
            { "六千",6000 },
            { "七千",7000 },
            { "八千",8000 },
            { "九千",9000 },
        };

        public static ChineseLexicon Lexion = new ChineseLexicon(Numerical);
    }
}
